Simulations/pipe_birdcarreau/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  BirdCarreau;

BirdCarreauCoeffs
{
    nu0         5.283e-5;  //mu0=0.056
    nuInf       3.302e-6;  //muInf=0.0035
    k           3.313;
    n           0.3568;
}


// ************************************************************************* //
